app/controllers/problems_controller.rb

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def show
    @problem = Problem.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE ("problems"."id" = 8) LIMIT 1

  def create
    @problem = Problem.new(params[:problem])
    @problem.user_id = current_user.id
    if @problem.save
---
INSERT INTO "problems" ("created_at", "desciption", "solution", "title", "updated_at", "user_id") VALUES ('2010-06-28 04:45:59.751798', '<p>This is that problem''s descripton</p>', '<p>And here is the solution</p>', 'This is the second problem we are encountering', '2010-06-28 04:45:59.751798', 5)