app/controllers/projects_controller.rb

  def index
    @projects = Project.where(:finished=> false)
---
SELECT "projects".* FROM "projects" WHERE ("projects"."finished" = 'f')

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1

  def edit
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 2) LIMIT 1

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "description", "expected_finish_date", "finished", "title", "updated_at") VALUES ('2010-07-16 04:07:28.813000', 'Knowledge Base', NULL, 'f', 'Braaainz', '2010-07-16 04:07:28.813000')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 3) LIMIT 1
UPDATE "projects" SET "finished" = 't', "updated_at" = '2010-07-16 04:25:28.638000' WHERE ("projects"."id" = 3)

   def finished
    @projects = Project.where(:finished=> true)
---
SELECT "projects".* FROM "projects" WHERE ("projects"."finished" = 't')