app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks"."id" = 1) LIMIT 1