app/controllers/timesheets_controller.rb

SELECT "timesheets".* FROM "timesheets"
---
  def index
    @timesheets = Timesheet.all