app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 5) LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 5) LIMIT 1
UPDATE "users" SET "last_request_at" = '2010-07-04 07:25:13.730723', "perishable_token" = '0g-BeNWfzVhx8S2VePTm' WHERE ("users"."id" = 5)